tonyao-/coreipm/trunk/coreipm/lpc21nn.h
/*##############################################################################
## UART0 / UART1
##############################################################################*/

/* ---- UART 0 --------------------------------------------- */
#define UART0_RBR       (*(REG32 (0xE000C000)))
#define UART0_THR       (*(REG32 (0xE000C000)))
#define UART0_IER       (*(REG32 (0xE000C004)))
#define UART0_IIR       (*(REG32 (0xE000C008)))
#define UART0_FCR       (*(REG32 (0xE000C008)))
#define UART0_LCR       (*(REG32 (0xE000C00C)))
#define UART0_MCR       (*(REG32 (0xE000C010)))
#define UART0_LSR       (*(REG32 (0xE000C014)))
#define UART0_MSR       (*(REG32 (0xE000C018)))
#define UART0_SCR       (*(REG32 (0xE000C01C)))
#define UART0_DLL       (*(REG32 (0xE000C000)))
#define UART0_DLM       (*(REG32 (0xE000C004)))
#define UART0_ACR       (*(REG32 (0xE000C020)))
#define UART0_FDR       (*(REG32 (0xE000C028)))
#define UART0_TER       (*(REG32 (0xE000C030)))

/* ---- UART 1 --------------------------------------------- */
#define UART1_RBR       (*(REG32 (0xE0010000)))
#define UART1_THR       (*(REG32 (0xE0010000)))
#define UART1_IER       (*(REG32 (0xE0010004)))
#define UART1_IIR       (*(REG32 (0xE0010008)))
#define UART1_FCR       (*(REG32 (0xE0010008)))
#define UART1_LCR       (*(REG32 (0xE001000C)))
#define UART1_MCR       (*(REG32 (0xE0010010)))
#define UART1_LSR       (*(REG32 (0xE0010014)))
#define UART1_MSR       (*(REG32 (0xE0010018)))
#define UART1_SCR       (*(REG32 (0xE001001C)))
#define UART1_DLL       (*(REG32 (0xE0010000)))
#define UART1_DLM       (*(REG32 (0xE0010004)))
#define UART1_ACR       (*(REG32 (0xE0010020)))
#define UART1_FDR       (*(REG32 (0xE0010028)))
#define UART1_TER       (*(REG32 (0xE0010030)))


/* Universal Asynchronous Receiver Transmitter 0 (UART0) */
#define U0RBR           UART0_RBR
#define U0THR           UART0_THR
#define U0IER           UART0_IER
#define U0IIR           UART0_IIR
#define U0FCR           UART0_FCR
#define U0LCR           UART0_LCR
#define U0MCR           UART0_MCR
#define U0LSR           UART0_LSR
#define U0MSR           UART0_MSR
#define U0SCR           UART0_SCR
#define U0DLL           UART0_DLL
#define U0DLM           UART0_DLM
#define U0ACR           UART0_ACR
#define U0FDR           UART0_FDR
#define U0TER           UART0_TER

/* Universal Asynchronous Receiver Transmitter 1 (UART1) */
#define U1RBR           UART1_RBR
#define U1THR           UART1_THR
#define U1IER           UART1_IER
#define U1IIR           UART1_IIR
#define U1FCR           UART1_FCR
#define U1LCR           UART1_LCR
#define U1MCR           UART1_MCR
#define U1LSR           UART1_LSR
#define U1MSR           UART1_MSR
#define U1SCR           UART1_SCR
#define U1DLL           UART1_DLL
#define U1DLM           UART1_DLM
#define U1ACR           UART1_ACR
#define U1FDR           UART1_FDR
#define U1TER           UART1_TER

/*##############################################################################
## I2C
##############################################################################*/

#define I2C_I2CONSET    (*(REG32 (0xE001C000)))
#define I2C_I2STAT      (*(REG32 (0xE001C004)))
#define I2C_I2DAT       (*(REG32 (0xE001C008)))
#define I2C_I2ADR       (*(REG32 (0xE001C00C)))
#define I2C_I2SCLH      (*(REG32 (0xE001C010)))
#define I2C_I2SCLL      (*(REG32 (0xE001C014)))
#define I2C_I2CONCLR    (*(REG32 (0xE001C018)))

#define I2C0_I2CONSET    I2C_I2CONSET
#define I2C0_I2STAT      I2C_I2STAT
#define I2C0_I2DAT       I2C_I2DAT
#define I2C0_I2ADR       I2C_I2ADR
#define I2C0_I2SCLH      I2C_I2SCLH
#define I2C0_I2SCLL      I2C_I2SCLL
#define I2C0_I2CONCLR    I2C_I2CONCLR

#define I2C1_I2CONSET    (*(REG32 (0xE005C000)))
#define I2C1_I2STAT      (*(REG32 (0xE005C004)))
#define I2C1_I2DAT       (*(REG32 (0xE005C008)))
#define I2C1_I2ADR       (*(REG32 (0xE005C00C)))
#define I2C1_I2SCLH      (*(REG32 (0xE005C010)))
#define I2C1_I2SCLL      (*(REG32 (0xE005C014)))
#define I2C1_I2CONCLR    (*(REG32 (0xE005C018)))

/* I2C Interface 0 */
#define I2C0CONSET      I2C_I2CONSET
#define I2C0STAT        I2C_I2STAT
#define I2C0DAT         I2C_I2DAT
#define I2C0ADR         I2C_I2ADR
#define I2C0SCLH        I2C_I2SCLH
#define I2C0SCLL        I2C_I2SCLL
#define I2C0CONCLR      I2C_I2CONCLR

/* I2C Interface 1 */
#define I2C1CONSET      I2C1_I2CONSET
#define I2C1STAT        I2C1_I2STAT
#define I2C1DAT         I2C1_I2DAT
#define I2C1ADR         I2C1_I2ADR
#define I2C1SCLH        I2C1_I2SCLH
#define I2C1SCLL        I2C1_I2SCLL
#define I2C1CONCLR      I2C1_I2CONCLR


/*##############################################################################
## SPI - Serial Peripheral Interface
##############################################################################*/

/* SPI0 (Serial Peripheral Interface 0) */
#define SPI_SPCR        (*(REG32 (0xE0020000)))
#define SPI_SPSR        (*(REG32 (0xE0020004)))
#define SPI_SPDR        (*(REG32 (0xE0020008)))
#define SPI_SPCCR       (*(REG32 (0xE002000C)))
#define SPI_SPTCR       (*(REG32 (0xE0020010)))
#define SPI_SPTSR       (*(REG32 (0xE0020014)))
#define SPI_SPTOR       (*(REG32 (0xE0020018)))
#define SPI_SPINT       (*(REG32 (0xE002001C)))

#define S0SPCR          SPI_SPCR	// SPI0 Control Register
#define S0SPSR          SPI_SPSR	// SPI0 Status Register
#define S0SPDR          SPI_SPDR	// SPI Data Register
#define S0SPCCR         SPI_SPCCR	// SPI Clock Counter Register
#define S0SPTCR         SPI_SPTCR
#define S0SPTSR         SPI_SPTSR
#define S0SPTOR         SPI_SPTOR
#define S0SPINT         SPI_SPINT	// SPI Interrupt Flag

/* SSP Controller (SPI1) */
#define SSPCR0          (*(REG32 (0xE0068000)))	// Control Register 0
#define SSPCR1          (*(REG32 (0xE0068004)))	// Control Register 1
#define SSPDR           (*(REG32 (0xE0068008)))	// Data Register
#define SSPSR           (*(REG32 (0xE006800C)))	// Status Register
#define SSPCPSR         (*(REG32 (0xE0068010)))	// Clock Prescale Register
#define SSPIMSC         (*(REG32 (0xE0068014)))	// Interrupt Mask Set and Clear Register
#define SSPRIS          (*(REG32 (0xE0068018)))	// Raw Interrupt Status Register
#define SSPMIS          (*(REG32 (0xE006801C)))	// Masked Interrupt Status Register
#define SSPICR          (*(REG32 (0xE0068020)))	// SSPICR Interrupt Clear Register

