tonyao-/coreipm/trunk/coreipm/lpc21nn.h
/* Real Time Clock */
#define ILR             RTC_ILR
#define CTC             RTC_CTC
#define CCR             RTC_CCR
#define CIIR            RTC_CIIR
#define AMR             RTC_AMR
#define CTIME0          RTC_CTIME0
#define CTIME1          RTC_CTIME1
#define CTIME2          RTC_CTIME2

#define SEC             RTC_SEC 
#define MIN             RTC_MIN
#define HOUR            RTC_HOUR
#define DOM             RTC_DOM
#define DOW             RTC_DOW
#define DOY             RTC_DOY
#define MONTH           RTC_MONTH
#define YEAR            RTC_YEAR

#define ALSEC           RTC_ALSEC
#define ALMIN           RTC_ALMIN
#define ALHOUR          RTC_ALHOUR
#define ALDOM           RTC_ALDOM
#define ALDOW           RTC_ALDOW
#define ALDOY           RTC_ALDOY
#define ALMON           RTC_ALMON
#define ALYEAR          RTC_ALYEAR

#define PREINT          RTC_PREINT
#define PREFRAC         RTC_PREFRAC

/* A/D Converter 0 (AD0) */
#define AD0CR           (*(REG32 (0xE0034000)))
#define AD0GDR          (*(REG32 (0xE0034004)))
#define AD0STAT         (*(REG32 (0xE0034030)))
#define AD0INTEN        (*(REG32 (0xE003400C)))
#define AD0DR0          (*(REG32 (0xE0034010)))
#define AD0DR1          (*(REG32 (0xE0034014)))
#define AD0DR2          (*(REG32 (0xE0034018)))
#define AD0DR3          (*(REG32 (0xE003401C)))
#define AD0DR4          (*(REG32 (0xE0034020)))
#define AD0DR5          (*(REG32 (0xE0034024)))
#define AD0DR6          (*(REG32 (0xE0034028)))
#define AD0DR7          (*(REG32 (0xE003402C)))

/* A/D Converter 1 (AD1) */
#define AD1CR           (*(REG32 (0xE0060000)))
#define AD1GDR          (*(REG32 (0xE0060004)))
#define AD1STAT         (*(REG32 (0xE0060030)))
#define AD1INTEN        (*(REG32 (0xE006000C)))
#define AD1DR0          (*(REG32 (0xE0060010)))
#define AD1DR1          (*(REG32 (0xE0060014)))
#define AD1DR2          (*(REG32 (0xE0060018)))
#define AD1DR3          (*(REG32 (0xE006001C)))
#define AD1DR4          (*(REG32 (0xE0060020)))
#define AD1DR5          (*(REG32 (0xE0060024)))
#define AD1DR6          (*(REG32 (0xE0060028)))
#define AD1DR7          (*(REG32 (0xE006002C)))

/* A/D Converter Global */
#define ADGSR           (*(REG32 (0xE0034008)))

/* D/A Converter */
#define DACR            (*(REG32 (0xE006C000)))

/*##############################################################################
## WD - Watchdog
##############################################################################*/

#define WD_WDMOD        (*(REG32 (0xE0000000)))
#define WD_WDTC         (*(REG32 (0xE0000004)))
#define WD_WDFEED       (*(REG32 (0xE0000008)))
#define WD_WDTV         (*(REG32 (0xE000000C)))

#define WDMOD           WD_WDMOD
#define WDTC            WD_WDTC
#define WDFEED          WD_WDFEED
#define WDTV            WD_WDTV

/* USB Controller */
#define USBIntSt        (*(REG32 (0xE01FC1C0)))
#define USBDevIntSt     (*(REG32 (0xE0090000)))
#define USBDevIntEn     (*(REG32 (0xE0090004)))
#define USBDevIntClr    (*(REG32 (0xE0090008)))
#define USBDevIntSet    (*(REG32 (0xE009000C)))
#define USBDevIntPri    (*(REG32 (0xE009002C)))
#define USBEpIntSt      (*(REG32 (0xE0090030)))
#define USBEpIntEn      (*(REG32 (0xE0090034)))
#define USBEpIntClr     (*(REG32 (0xE0090038)))
#define USBEpIntSet     (*(REG32 (0xE009003C)))
#define USBEpIntPri     (*(REG32 (0xE0090040)))
#define USBReEp         (*(REG32 (0xE0090044)))
#define USBEpInd        (*(REG32 (0xE0090048)))
#define USBMaxPSize     (*(REG32 (0xE009004C)))
#define USBRxData       (*(REG32 (0xE0090018)))
#define USBRxPLen       (*(REG32 (0xE0090020)))
#define USBTxData       (*(REG32 (0xE009001C)))
#define USBTxPLen       (*(REG32 (0xE0090024)))
#define USBCtrl         (*(REG32 (0xE0090028)))
#define USBCmdCode      (*(REG32 (0xE0090010)))
#define USBCmdData      (*(REG32 (0xE0090014)))
#define USBDMARSt       (*(REG32 (0xE0090050)))
#define USBDMARClr      (*(REG32 (0xE0090054)))
#define USBDMARSet      (*(REG32 (0xE0090058)))
#define USBUDCAH        (*(REG32 (0xE0090080)))
#define USBEpDMASt      (*(REG32 (0xE0090084)))
#define USBEpDMAEn      (*(REG32 (0xE0090088)))
#define USBEpDMADis     (*(REG32 (0xE009008C)))
#define USBDMAIntSt     (*(REG32 (0xE0090090)))
#define USBDMAIntEn     (*(REG32 (0xE0090094)))
#define USBEoTIntSt     (*(REG32 (0xE00900A0)))
#define USBEoTIntClr    (*(REG32 (0xE00900A4)))
#define USBEoTIntSet    (*(REG32 (0xE00900A8)))
#define USBNDDRIntSt    (*(REG32 (0xE00900AC)))
#define USBNDDRIntClr   (*(REG32 (0xE00900B0)))
#define USBNDDRIntSet   (*(REG32 (0xE00900B4)))
#define USBSysErrIntSt  (*(REG32 (0xE00900B8)))
#define USBSysErrIntClr (*(REG32 (0xE00900BC)))
#define USBSysErrIntSet (*(REG32 (0xE00900C0)))

/*##############################################################################
## System Control Block
##############################################################################*/

#define SCB_EXTINT      (*(REG32 (0xE01FC140)))
#define SCB_EXTWAKE     (*(REG32 (0xE01FC144)))
#define SCB_MEMMAP      (*(REG32 (0xE01FC040)))
#define SCB_PLLCON      (*(REG32 (0xE01FC080)))
#define SCB_PLLCFG      (*(REG32 (0xE01FC084)))
#define SCB_PLLSTAT     (*(REG32 (0xE01FC088)))
#define SCB_PLLFEED     (*(REG32 (0xE01FC08C)))
#define SCB_PCON        (*(REG32 (0xE01FC0C0)))
#define SCB_PCONP       (*(REG32 (0xE01FC0C4)))
#define SCB_VPBDIV      (*(REG32 (0xE01FC100)))

/* Phase Locked Loop 0 (PLL0) */
#define PLL0CON         (*(REG32 (0xE01FC080)))
#define PLL0CFG         (*(REG32 (0xE01FC084)))
#define PLL0STAT        (*(REG32 (0xE01FC088)))
#define PLL0FEED        (*(REG32 (0xE01FC08C)))

/* Phase Locked Loop 1 (PLL1) */
#define PLL1CON         (*(REG32 (0xE01FC0A0)))
#define PLL1CFG         (*(REG32 (0xE01FC0A4)))
#define PLL1STAT        (*(REG32 (0xE01FC0A8)))
#define PLL1FEED        (*(REG32 (0xE01FC0AC)))

#define VPBDIV          SCB_VPBDIV

#define PCON            SCB_PCON
#define PCONP           SCB_PCONP

#define EXTINT          SCB_EXTINT
#define INTWAKE         SCB_EXTWAKE
#define EXTMODE         (*(REG32 (0xE01FC148)))
#define EXTPOLAR        (*(REG32 (0xE01FC14C)))

/* Reset */
#define RSID            (*(REG32 (0xE01FC180)))

