tonyao-/coreipm/trunk/coreipm/lpc21nn.h
/* Code Security / Debugging */
#define CSPR            (*(REG32 (0xE01FC184)))

/* System Control Miscellaneous */
#define SCS             (*(REG32 (0xE01FC1A0)))
#endif /* lpc210x_h */


/* PINSEL0 register setting flags */

#define PS0_P0_0_GPIO		0x00000000
#define PS0_P0_0_TXD_UART_0	0x00000001
#define PS0_P0_0_PWM_1		0x00000002

#define PS0_P0_1_GPIO		0x00000000
#define PS0_P0_1_RXD_UART_0	0x00000004
#define PS0_P0_1_PWM_3		0x00000008
#define PS0_P0_1_EINT_0		0x0000000c

#define PS0_P0_2_GPIO		0x00000000
#define PS0_P0_2_SCL_I2C_0	0x00000010
#define PS0_P0_2_CAPTURE_00	0x00000020

#define PS0_P0_3_GPIO		0x00000000
#define PS0_P0_3_SDA_I2C_0	0x00000040
#define PS0_P0_3_MATCH_0_0	0x00000080
#define PS0_P0_3_EINT_1		0x000000c0

#define PS0_P0_4_GPIO		0x00000000
#define PS0_P0_4_SCK_0		0x00000100
#define PS0_P0_4_CAPTURE_0_1	0x00000200
#define PS0_P0_4_AD_06		0x00000300

#define PS0_P0_5_GPIO		0x00000000
#define PS0_P0_5_MISO_0		0x00000400
#define PS0_P0_5_MATCH_0_1	0x00000800
#define PS0_P0_5_AD_0_7		0x00000c00

#define PS0_P0_6_GPIO		0x00000000
#define PS0_P0_6_MOSI_0		0x00001000
#define PS0_P0_6_CAPTURE_0_2	0x00002000
#define PS0_P0_6_AD_1_0		0x00003000

#define PS0_P0_7_GPIO		0x00000000
#define PS0_P0_7_SSEL_0		0x00004000
#define PS0_P0_7_PWM_2		0x00008000
#define PS0_P0_7_EINT_2		0x0000c000

#define PS0_P0_8_GPIO		0x00000000
#define PS0_P0_8_TDX_UART_1	0x00010000
#define PS0_P0_8_PWM_4		0x00020000
#define PS0_P0_8_AD_1_1		0x00030000

#define PS0_P0_9_GPIO		0x00000000
#define PS0_P0_9_RDX_UART_1	0x00040000
#define PS0_P0_9_PWM_6		0x00080000
#define PS0_P0_9_EINT_3		0x000c0000

#define PS0_P0_10_GPIO		0x00000000
#define PS0_P0_10_RTS_UART_1	0x00100000
#define PS0_P0_10_CAPTURE_1_0	0x00200000
#define PS0_P0_10_AD_1_2	0x00300000

#define PS0_P0_11_GPIO		0x00000000
#define PS0_P0_11_CTS_UART_1	0x00400000
#define PS0_P0_11_CAPTURE_1_1	0x00800000
#define PS0_P0_11_SCL_I2C_1	0x00c00000

#define PS0_P0_12_GPIO		0x00000000
#define PS0_P0_12_DSR_UART_1	0x01000000
#define PS0_P0_12_MATCH_1_0	0x02000000
#define PS0_P0_12_AD_1_3	0x03000000

#define PS0_P0_13_GPIO		0x00000000
#define PS0_P0_13_DTR_UART_1	0x04000000
#define PS0_P0_13_MATCH_1_1	0x08000000
#define PS0_P0_13_AD_1_4	0x0c000000

#define PS0_P0_14_GPIO		0x00000000
#define PS0_P0_14_DCD_UART_1	0x10000000
#define PS0_P0_14_EINT_1	0x20000000
#define PS0_P0_14_SDA_I2C_1	0x30000000

#define PS0_P0_15_GPIO		0x00000000
#define PS0_P0_15_RI_UART_1	0x40000000
#define PS0_P0_15_EINT_2	0x80000000
#define PS0_P0_15_AD_1_5	0xc0000000


/* PINSEL1 register setting flags */

#define PS1_P0_16_GPIO		0x00000000
#define PS1_P0_16_EINT_0	0x00000001
#define PS1_P0_16_MATCH_0_2	0x00000002
#define PS1_P0_16_CAPTURE_0_2	0x00000003

#define PS1_P0_17_GPIO		0x00000000
#define PS1_P0_17_CAPTURE_1_2	0x00000004
#define PS1_P0_17_SCK_1		0x00000008
#define PS1_P0_17_MATCH_1_2	0x0000000c

#define PS1_P0_18_GPIO		0x00000000
#define PS1_P0_18_CAPTURE_1_3	0x00000010
#define PS1_P0_18_MISO_1	0x00000020
#define PS1_P0_18_MATCH_1_3	0x00000030

#define PS1_P0_19_GPIO		0x00000000
#define PS1_P0_19_MATCH_1_2	0x00000040
#define PS1_P0_19_MOSI_1	0x00000080
#define PS1_P0_19_CAPTURE_1_2	0x000000c0

#define PS1_P0_20_GPIO		0x00000000
#define PS1_P0_20_MATCH_1_3	0x00000100
#define PS1_P0_20_SSEL_1	0x00000200
#define PS1_P0_20_EINT_3	0x00000300

#define PS1_P0_21_GPIO		0x00000000
#define PS1_P0_21_PWM_5		0x00000400
#define PS1_P0_21_AD_1_6	0x00000800
#define PS1_P0_21_CAPTURE_1_3	0x00000c00

#define PS1_P0_22_GPIO		0x00000000
#define PS1_P0_22_AD_1_7	0x00001000
#define PS1_P0_22_CAPTURE_0_0	0x00002000
#define PS1_P0_22_MATCH_0_0	0x00003000

#define PS1_P0_23_GPIO		0x00000000
#define PS1_P0_23_V_BUS		0x00004000

#define PS1_P0_25_GPIO		0x00000000
#define PS1_P0_25_AD_0_4	0x00040000
#define PS1_P0_25_DAC_A_OUT 	0x00080000

#define PS1_P0_28_GPIO		0x00000000
#define PS1_P0_28_AD_0_1	0x01000000
#define PS1_P0_28_CAPTURE_0_2	0x02000000
#define PS1_P0_28_MATCH_0_2	0x03000000

#define PS1_P0_29_GPIO		0x00000000
#define PS1_P0_29_AD_0_2	0x04000000
#define PS1_P0_29_CAPTURE_0_3	0x08000000
#define PS1_P0_29_MATCH_0_3	0x0c000000

#define PS1_P0_30_GPIO		0x00000000
#define PS1_P0_30_AD_0_3	0x10000000
#define PS1_P0_30_EINT_3	0x20000000
#define PS1_P0_30_CAPTURE_0_0	0x30000000

#define PS1_P0_31_GPIO		0x00000000
#define PS1_P0_31_UP_LED	0x40000000
#define PS1_P0_31_CONNECT	0x80000000
#define PS1_P0_31_AD_1_5	0xc0000000

/* PINSEL2 register setting flags */
#define PS2_P1_26_36_GPIO	0x00000000
#define PS2_P1_26_36_DEBUG	0x00000004
#define PS2_P1_16_25_GPIO	0x00000000
#define PS2_P1_16_25_TRACE	0x00000008



#define P0_0	0x00000001	// P0.0
#define P0_1	0x00000002	// P0.1
#define P0_2	0x00000004	// P0.2
#define P0_3	0x00000008	// P0.3
#define P0_4	0x00000010	// P0.4
#define P0_5	0x00000020	// P0.5
#define P0_6	0x00000040	// P0.6
#define P0_7	0x00000080	// P0.7
#define P0_8	0x00000100	// P0.8
#define P0_9	0x00000200	// P0.9
#define P0_10	0x00000400	// P0.10
#define P0_11	0x00000800	// P0.11
#define P0_12	0x00001000	// P0.12
#define P0_13	0x00002000	// P0.13
#define P0_14	0x00004000	// P0.14
#define P0_15	0x00008000	// P0.15
#define P0_16	0x00010000	// P0.16
#define P0_17	0x00020000	// P0.17
#define P0_18	0x00040000	// P0.18
#define P0_19	0x00080000	// P0.19
#define P0_20	0x00100000	// P0.20
#define P0_21	0x00200000	// P0.21
#define P0_22	0x00400000	// P0.22
#define P0_23	0x00800000	// P0.23
#define P0_24	0x01000000	// P0.24
#define P0_25	0x02000000	// P0.25
#define P0_26	0x04000000	// P0.26
#define P0_27	0x08000000	// P0.27
#define P0_28	0x10000000	// P0.28
#define P0_29	0x20000000	// P0.29
#define P0_30	0x40000000	// P0.30
#define P0_31	0x80000000	// P0.31

#define P1_0	0x0000000100000000	// P1.0
#define P1_1	0x0000000200000000	// P1.1
#define P1_2	0x0000000400000000	// P1.2
#define P1_3	0x0000000800000000	// P1.3
#define P1_4	0x0000001000000000	// P1.4
#define P1_5	0x0000002000000000	// P1.5
#define P1_6	0x0000004000000000	// P1.6
#define P1_7	0x0000008000000000	// P1.7
#define P1_8	0x0000010000000000	// P1.8
#define P1_9	0x0000020000000000	// P1.9
#define P1_10	0x0000040000000000	// P1.10
#define P1_11	0x0000080000000000	// P1.11
#define P1_12	0x0000100000000000	// P1.12
#define P1_13	0x0000200000000000	// P1.13
#define P1_14	0x0000400000000000	// P1.14
#define P1_15	0x0000800000000000	// P1.15
#define P1_16	0x0001000000000000	// P1.16
#define P1_17	0x0002000000000000	// P1.17
#define P1_18	0x0004000000000000	// P1.18
#define P1_19	0x0008000000000000	// P1.19
#define P1_20	0x0010000000000000	// P1.20
#define P1_21	0x0020000000000000	// P1.21
#define P1_22	0x0040000000000000	// P1.22
#define P1_23	0x0080000000000000	// P1.23
#define P1_24	0x0100000000000000	// P1.24
#define P1_25	0x0200000000000000	// P1.25
#define P1_26	0x0400000000000000	// P1.26
#define P1_27	0x0800000000000000	// P1.27
#define P1_28	0x1000000000000000	// P1.28
#define P1_29	0x2000000000000000	// P1.29
#define P1_30	0x4000000000000000	// P1.30
#define P1_31	0x8000000000000000	// P1.31





